       IDENTIFICATION DIVISION.
       PROGRAM-ID. ATIVIDADE07.
 
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 VALOR-FATURA PIC Z(4)9.99.
 
       PROCEDURE DIVISION.
       MOVE 000235.40 TO VALOR-FATURA
       DISPLAY "TOTAL DA FATURA:  " VALOR-FATURA
       
       STOP RUN.
       